Box office hits database

In [1]:
CREATE TABLE movies (id INTEGER PRIMARY KEY, name TEXT, release_year INTEGER);
INSERT INTO movies VALUES (1, "Avatar", 2009);
INSERT INTO movies VALUES (2, "Titanic", 1997);
INSERT INTO movies VALUES (3, "Star Wars: Episode IV - A New Hope", 1977);
INSERT INTO movies VALUES (4, "Shrek 2", 2004);
INSERT INTO movies VALUES (5, "The Lion King", 1994);
INSERT INTO movies VALUES (6, "Disney's Up", 2009);
 
 
SELECT * FROM movies;

SELECT * FROM movies WHERE release_year > 2000 ORDER BY release_year;

SyntaxError: ignored

TODO list database stats

Here's a table containing a TODO list with the number of minutes it will take to complete each item. Insert another item to your todo list with the estimated minutes it will take.

In [ ]:
CREATE TABLE todo_list (id INTEGER PRIMARY KEY, item TEXT, minutes INTEGER);
INSERT INTO todo_list VALUES (1, "Wash the dishes", 15);
INSERT INTO todo_list VALUES (2, "vacuuming", 20);
INSERT INTO todo_list VALUES (3, "Learn some stuff on KA", 30);
INSERT INTO todo_list VALUES (4, "workout", 60);

SELECT SUM(minutes) FROM todo_list;

Project: Design a store database

In [ ]:
CREATE TABLE cars (id INTEGER PRIMARY KEY, name TEXT, year INTEGER, miles INTEGER, price INTEGER, style TEXT);

INSERT INTO cars VALUES(1, "BMW", 2021, 500, 75000, "sedan");
INSERT INTO cars VALUES(2, "TOYOTA", 2015, 100000, 16000, "SUV");
INSERT INTO cars VALUES(3, "TESLA", 2018, 32000, 45000, "sedan");
INSERT INTO cars VALUES(4, "FORD", 2019, 15000, 23000, "SUV");
INSERT INTO cars VALUES(5, "MERCEDES BENZ", 2020, 8000, 67000, "sedan");
INSERT INTO cars VALUES(6, "PORSCHE", 2018, 3200, 125000, "sports car");
INSERT INTO cars VALUES(7, "FERRARI", 2015, 8000, 179000, "sports car");
INSERT INTO cars VALUES(8, "MASARATI", 2018, 25000, 65000, "SUV");
INSERT INTO cars VALUES(9, "VOLKSWAGEN", 2010, 130000, 9000, "sedan");
INSERT INTO cars VALUES(10, "LEXUS", 2019, 17000, 56000, "SUV");
INSERT INTO cars VALUES(11, "ACURA", 2016, 50000, 32000, "sedan");
INSERT INTO cars VALUES(12, "MAZDA", 2021, 8000, 43000, "sports car");
INSERT INTO cars VALUES(13, "CADILLAC", 2022, 54, 98000, "SUV");
INSERT INTO cars VALUES(14, "LAND ROVER", 2021, 12000, 57000, "SUV");
INSERT INTO cars VALUES(15, "BENTLEY", 2022, 245, 260000, "SUV");

SELECT * FROM cars WHERE price > 50000 ORDER BY price;

SELECT style, SUM(miles) FROM cars GROUP BY price;